# lesson 02 task 07
#
# Напишите программу, доказывающую или проверяющую,
# что для множества натуральных чисел выполняется равенство:
# 1+2+...+n = n(n+1)/2, где n - любое натуральное число.

# Функция подсчета суммы
def summa(n):
    if n == 0:
        return 0
    return n + summa(n - 1)

# Ввод числа
while True:
    try:
        n = input('Введите натуральное число: ')
        n = int(n)
        if n < 1:
            print(f'Ошибка: "{n}" должно быть больше нуля')
            continue
        break
    except ValueError:
        print(f'Ошибка: "{n}" не является натуральным числом')

# Подсчет
res1 = summa(n)
res2 = n * (n + 1) // 2

# Вывод результата
print(f'Сумма от 1 до n = {res1}')
print(f'n*(n+1)/2 = {res2}')

if res1 == res2:
    print("Результат обоих способов подсчета одинаков")
else:
    print("Что-то не так")
