# lesson 02 task 01
#
# Написать программу, которая будет складывать, вычитать,
# умножать или делить два числа.
# Числа и знак операции вводятся пользователем.
# После выполнения вычисления программа не должна завершаться,
# а должна запрашивать новые данные для вычислений.
# Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.
# Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'),
# то программа должна сообщать ему об ошибке и снова запрашивать знак операции.
# Также сообщать пользователю о невозможности деления на ноль,
# если он ввел 0 в качестве делителя.

while True:
    # Ввод действия
    while True:
        op = input('Введите операцию (+, -, *, /) или 0 для выхода: ')
        if op in '+-*/0':
            break
    if op == '0':
        break

    # Ввод чисел
    while True:
        x = input('Введите число x: ')
        try:
            x = float(x)
            break
        except ValueError:
            print(f'Ошибка: "{x}" не является числом')
    while True:
        y = input('Введите число y: ')
        try:
            y = float(y)
            if op == '/' and not y:
                print('Ошибка: на ноль делить нельзя')
                continue
            break
        except ValueError:
            print(f'Ошибка: "{y}" не является числом')

    # Блок выполнения операции
    res = float()
    if op == '+':
        res = x + y
    elif op == '-':
        res = x - y
    elif op == '*':
        res = x * y
    elif op == '/':
        res = x / y
    print(f'{x} {op} {y} = {round(res, 8)}')
