# lesson 02 task 02
#
# Посчитать четные и нечетные цифры введенного натурального числа.
# Например, если введено число 34560,
# то у него 3 четные цифры (4, 6 и 0) и 2 нечетные (3 и 5).

# Ввод числа
while True:
    try:
        n = input('Введите натуральное число: ')
        n_copy = int(n)
        n = abs(n_copy)
        break
    except ValueError:
        print(f'Ошибка: "{n}" не является натуральным числом')

# Подсчет цифр
odd = 0
even = 0 if n else 1
while n > 0:
    if n % 2:
        odd += 1
    else:
        even += 1
    n = n // 10

# Вывод результата
print(f'В числе {n_copy}')
print(f'четных цифр {even}')
print(f'нечетных цифр {odd}')
