# lesson 01 task 04
#
#  Написать программу, которая генерирует в указанных пользователем границах:
#     случайное целое число;
#     случайное вещественное число;
#     случайный символ.
# Для каждого из трех случаев пользователь задает свои границы диапазона.
# Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
# Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.

import random

# Блок ввода выбора:
choise = input('Выберите, что генерировать: \n'
               'i - целое\n'
               'f - вещественное\n'
               'c - символ: ')

if choise == 'i':
    min_number = int(input('Введите нижнюю границу диапазона (целое число): '))
    max_number = int(input('Введите верхнюю границу диапазона (целое число): '))

    rand = random.randint(min_number, max_number)

    print(f'Случайное число в диапозоне от {min_number} до {max_number}: {rand}')
elif choise == 'f':
    min_number = float(input('Введите нижнюю границу диапазона (вещественное число): '))
    max_number = float(input('Введите верхнюю границу диапазона (вещественное число): '))

    rand = random.uniform(min_number, max_number)

    print(f'Случайное число в диапозоне от {min_number} до {max_number}: {rand}')
elif choise == 'c':
    min_char = input('Введите нижнюю границу диапазона (символ): ')
    max_char = input('Введите верхнюю границу диапазона (символ): ')

    rand = chr(random.randint(ord(min_char), ord(max_char)))

    print(f'Случайный символ в диапозоне от {min_char} до {max_char}: {rand}')
else:
    print(f'Ошибка: введен неверный символ {choise}')
