# lesson 01 task 03
#
# По введенным пользователем координатам двух точек вывести
# уравнение прямой вида y=kx+b, проходящей через эти точки.

# Блок ввода координат двух точек
x1 = float(input("введите x1: "))
y1 = float(input("введите y1: "))
x2 = float(input("введите x2: "))
y2 = float(input("введите y2: "))

# Блок проверки паралельности оси OY
if x1 == x2:
    print(f'x={x1}')
    exit()

# Блок расчета коэффициентов
k = (y2 - y1)/(x2 - x1)
b = y1 - k * x1

# Блок вывода уроавнения прямой
print(f'y={k}x+{b}')
