# lesson 01 task 05
#
# Пользователь вводит две буквы.
# Определить, на каких местах алфавита они стоят и сколько между ними находится букв.

# Блок ввода букв
print("Введите две буквы")
l1 = input("введите первую букву: ")
l2 = input("введите вторую букву: ")

# Блок вычисления позиций букв
pos_l1 = ord(l1) - ord("a") + 1
pos_l2 = ord(l2) - ord("a") + 1

# Блок вывода позиций букв
print(f'Позиция первой буквы: {pos_l1}')
print(f'Позиция второй буквы: {pos_l2}')

# Блок вычисления количества букв между буквами
diff_pos = abs(pos_l1 - pos_l2)
if diff_pos > 0:
    diff_pos -= 1

# Блок вывода количества букв между буквами
print(f'Между буквами {diff_pos} букв')
