# lesson 01 task 09
#
# Вводятся три разных числа.
# Найти, какое из них является средним (больше одного, но меньше другого).

# Блок ввода чисел
num1 = int(input("введите первое число: "))
num2 = int(input("введите второе число: "))
num3 = int(input("введите третье число: "))

# Блок сортировки первых двух чисел
if num1 > num2:
    num1, num2 = num2, num1

# Блок поиска среднего числа
if num3 > num2:
    print(f'Среднее число из чисел {num1},{num2},{num3} - {num2}')
elif num3 < num1:
    print(f'Среднее число из чисел {num1},{num2},{num3} - {num1}')
else:
    print(f'Среднее число из чисел {num1},{num2},{num3} - {num3}')
