# lesson 01 task 02
#
# Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
# Объяснить полученный результат.

# Битовоы представления чисел 5 и 6:
# bin(5) == 0b101
# bin(6) == 0b110

print(5 & 6)
# При побитовом "И" в каждом разряде выставляется 1,
# если в этой позиции у обоих чисел 1
# результат: 0b100
# 0b100 == bin(4)

print(5 | 6)
# При побитовом "ИЛИ" в каждом разряде выставляется 1,
# если в этой позиции у любого числа есть 1
# результат: 0b111
# 0b111 == bin(7)

print(5 >> 2)
# При побитовым сдвиге вправо на два знака
# откидываются два разряда справа
# результат: 0b1
# 0b1 == bin(1)

print(5 << 2)
# При побитовым сдвиге влево на два знака
# справа добавляется два 0
# результат: 0b10100
# 0b10100 == bin(20)
