# lesson 01 task 07
#
# По длинам трех отрезков, введенных пользователем, определить возможность существования треугольника,
# составленного из этих отрезков.
# Если такой треугольник существует, то определить, является ли он разносторонним,
# равнобедренным или равносторонним.

# Блок ввода длин отрезков
a = abs(int(input('введите длину отрезка A: ')))
b = abs(int(input('введите длину отрезка B: ')))
c = abs(int(input('введите длину отрезка C: ')))

# Блок проверки возможности треугольника
if a + b <= c or a + c <= b or b + c <= a:
    print('Из отрезков A, B и C треугольник невозможен')
# Блок проверки равносторонности
elif a == b == c:
    print('Треугольник ABC равносторонний')
# Блок проверки равнобедренности
elif a != b and a != c and b != c:
    print('Треугольник ABC разносторонний')
else:
    print('Треугольник ABC равнобедренный')


