# Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

# Блок ввод трехзначного числа:
number = abs(int(input("введите трехзначное число: ")))

# Блок проверки что число трехзначное
if len(str(number)) != 3:
    print("Ошибка: введено не трехзначное число")

# Блок получения суммы и произведения цифр числа
summ = int(str(number)[0]) + int(str(number)[1]) + int(str(number)[2])
mult = int(str(number)[0]) * int(str(number)[1]) * int(str(number)[2])

# Блок вывода суммы и произведения цифр числа
print(f' Сумма трех чисел: {summ}')
print(f' Произведение трех чисел: {mult}')
